# --coding:utf-8--

# Ввод данных: целевой и текущий код
# вводятся как четырехзначные числа
a = int(input("Введите текущий код: "))
m = 0  # Количество цифр целевого кода
b = int(input("Введите целевой код: "))
n = 0  # Количесво цифр текущего кода
total_moves = 0
a1 = a
b1 = b
# Количество цифр текущего кода
while (a1 > 0):
    m += 1
    a1 //= 10
# Количество цифр целевого кода
while (b1 > 0):
    n += 1
    b1 //= 10
# Проверка на совпадение длины текущего и целевого кода
# Если длина текущего кода не равна длине целевого
# и оба кода не четырёхзначные, программа завершает работу.
if (m != 4) or (n != 4) or (m != n):
    print("Комбинация кодового замка должна быть 4 цифры.")
    print("Текущий и целевой код должны быть одинаковой длины.")
    exit()
a1 = a
b1 = b
# Перебор цифр текущего и целевого кода
while (a1 > 0) and (b1 > 0):
    d1 = a1 % 10  # Цифра текущего кода
    d2 = b1 % 10  # Цифра целевого кода
    diff1 = abs(d1 - d2)  # разность цифр, прямой ход диска
    diff2 = 10 - abs(d1 - d2)  # разность цифр, обратный ход диска
    # Мнинимальное число ходов - разность между каждой цифрой диска
    # в целевом коде и текущем коде замка сейфа
    total_moves += min(diff1, diff2)
    a1 //= 10  # Переход к следующей цифре текущего кода
    b1 //= 10  # Переход к следующей цифре целевого кода
# Вывод информации на экран
print(f"Текущий код:{a}")
print(f"Целевой код:{b}")
print(f"Мнинимальное число ходов:{total_moves}")
