# --coding:utf-8--

# Чтение входных данных
a = input("Введите текущий код: ")  # Ввод текущего кода
b = input("Введите целевой код: ")  # Ввод целового кода
a = a.strip()  # Удаление ненужных пробелов
b = b.strip()  # Удаление ненужных пробелов
n_len1 = len(a)  # Вычислить длину 1-ой строки
n_len2 = len(b)  # Вычислить длину 2-ой строки
# Проверка на совпадение длины текущего и целевого кода
# Если длина текущего кода не равна длине целевого
# и оба кода не четырёхзначные, программа завершает работу.
if (n_len1 != 4) or (n_len2 != 4) or (n_len1 != n_len2):
    print("Комбинация кодового замка должна быть 4 цифры.")
    print("Текущий и целевой код должны быть одинаковой длины.")
    exit()
# Подсчет минимального количества ходов
total_moves = 0  # Счётчик ходов
for x, y in zip(a, b):
    diff1 = abs(int(x) - int(y))  # разность цифр, прямой ход диска
    diff2 = 10 - abs(int(x) - int(y))  # разность цифр, обратный ход диска
    # Мнинимальное число ходов - разность между каждой цифрой диска
    # в целевом коде и текущем коде замка сейфа
    total_moves += min(diff1, diff2)  # Общее число ходов - ответ на вопрос
# Вывод информации на экран
print(f"Текущий код:{a}")
print(f"Целевой код:{b}")
print(f"Мнинимальное число ходов:{total_moves}")
