# --coding:utf-8--

# Чтение входных данных
a = input("Введите текущий код: ").strip()  # Ввод текущего кода
b = input("Введите целевой код: ").strip()  # Ввод целового кода
# Подсчет минимального количества ходов
total_moves = 0  # Счётчик ходов
for x, y in zip(a, b):
    diff1 = abs(int(x) - int(y))  # разность цифр, прямой ход диска
    diff2 = 10 - abs(int(x) - int(y))  # разность цифр, обратный ход диска
    # Мнинимальное число ходов - разность между каждой цифрой диска
    # в целевом коде и текущем коде замка сейфа
    total_moves += min(diff1, diff2)  # Общее число ходов - ответ на вопрос
print(f"Текущий код:{a}")
print(f"Целевой код:{b}")
print(f"Мнинимальное число ходов:{total_moves}")
